{
    "Content": [
      {
        "title": "overview",
        "pageContent": "<h3><b>Programs<\/b><\/h3><p>We've designed a unique program at the Academy that is for everyone. We combine Brazilian Jiu-Jitsu, Mixed Martial Arts & Kickboxing techniques to make you a complete martial artist. You will learn to be confident in defending yourself on your feet as well as on the ground. Best of all, we teach it in a fun and safe way so that everyone in the whole family will enjoy!<\/p><p>You will start in a beginners class with people just like yourself. Class by class you will learn practical self-defense while increasing your strength, flexibility and cardio conditioning.<\/p><p>Our programs are specifically developed to improve your abilities at your own pace and takes into account people of all ages, both male and female.<\/p><p>You will get into the best shape of your life while learning how to defend yourself and have a great time doing it!<\/p><h3><b>Brazilian Jiu Jitsu<\/b><\/h3><p>Of course, most people have heard of Brazilian Jiu Jitsu by now. An extremely effective ground fighting Martial Art developed by the Gracie family of Brazil. Jiu Jitsu deals with the fact that 90% of all self-defense situations end up on the ground.<\/p><h3><b>Mixed Martial Arts<\/b><\/h3><p>Mixed Martial Arts is the fastest growing and most exciting sport in the world today. It consists of a combination of stand up striking techniques and ground grappling submissions. MMA has been made popular by the many pay per view events such as the UFC. These events are certainly the most extreme expression of the sport and the one that the general public is most exposed to.<\/p><p>However, what many people have come to realize through training at our Academy is that when practiced with discretion and control mixed martial arts is a fun, safe and exciting way to get a great work out. It's so safe that we have entire families who have joined and are having the time of their lives. It is the ultimate in self-defense training.<\/p><h3><b>Kickboxing<\/b><\/h3><p>No self defense program is complete without knowledge of kicking and punching. At the Academy you will be given lessons in kickboxing as well. Learning kicks, punches and blocks will give you the confidence you need to start your stand up game. Practicing drills on bags and pads you will see yourself advancing in no time!<\/p>"
      },
      {
        "title": "tinyTigers",
        "pageContent": "<h3><b>Tiny Tigers<\/b><\/h3><p>Our Tiny Tiger program is specifically developed to teach preschoolers ages 4-6 years. Teaching important life skills in a fun, exciting, and positive manner.<\/p><p>This program will improve your child's listening skills, focus, confidence, self control and so much more!<\/p><p><b>Your child will achieve more than just learning self-defense.<\/b><\/p><p>The Tiny Tiger classes will keep your child physically fit and many of our unique drills used in class show children the benefits of good behavior. Best of all, your child's class curriculum will also help them see the value of teamwork, good manners and trying their best outside of the Academy too.<\/p><p>Your child will love this exciting, fun, high energy class and so will you!<\/p>"
      },
      {
        "title": "juniorGrapplers",
        "pageContent": "<h3><b>Junior Grapplers<\/b><\/h3><p><b>If you're looking for a all around Self Improvement program for your child you've come to the right place<\/b><\/p><p>As you well know this age bracket is very impressionable and we take this opportunity to instill in our students a positive self-image. Topics like peer pressure, respect, bullying, and a healthy diet and lifestyle are routinely discussed. <\/p><p>With computers and video games becoming more and more popular, along with childhood obesity statistics rising, children today simply aren't getting enough exercise. Here at the Academy, we offer fun, physical and mental challenges that will improve your child's well being.<\/p><p>You will see a positive change in your child.<\/p><p>We guarantee it<\/p>"
      },
      {
        "title": "teens",
        "pageContent": "<h3><b>Teens<\/b><\/h3><p>This program is specifically developed to gradually improve your abilities and take into account people of all ages, both male and female.<\/p><p>You will start in a beginner class with people just like yourself. Class by class you will learn practical self defense as well as cardiovascular drills and yoga stretches to increase your strength and flexibility.<\/p><p>Many of our students are amazed at their increased physical endurance and weight loss they have achieved!<\/p><p>Whether you are practicing jiu jitsu on the ground or kick-boxing on your feet, you will be taught at a pace that is right for you.<\/p>"
      },
      {
        "title": "adults",
        "pageContent": "<h3><b>Adults<\/b><\/h3><p>This program is specifically developed to gradually improve your abilities and take into account people of all ages, both male and female.<\/p><p>You will start in a beginner class with people just like yourself. Class by class you will learn practical self defense as well as cardiovascular drills and yoga stretches to increase your strength and flexibility.<p><p>Many of our students are amazed at their increased physical endurance and weight loss they have achieved!<\/p><p>Whether you are practicing jiu jitsu on the ground or kick-boxing on your feet, you will be taught at a pace that is right for you.<\/p>"
      }
            
    ],
    
      "schedule": [
        {
           "day": "monday",
           "program": "tinyTigers",
           "content": "1"
        },
        {
           "day": "tuesday",
           "program": "tinyTigers",
           "content": "2"
       },
       {
           "day": "wednesday",
           "program": "tinyTigers",
           "content": "3"
         },
         {
           "day": "thursday",
           "program": "tinyTigers",
           "content": "4"
       }, {
           "day": "friday",
           "program": "tinyTigers",
           "content": "5"
       },
       {
         "day": "monday",
         "program": "juniorGrapplers",
         "content": "6"
      },
      {
         "day": "tuesday",
         "program": "juniorGrapplers",
         "content": "7"
     },
     {
         "day": "wednesday",
         "program": "juniorGrapplers",
         "content": "8"
       },
       {
         "day": "thursday",
         "program": "juniorGrapplers",
         "content": "9"
     }, {
         "day": "friday",
         "program": "juniorGrapplers",
         "content": "10"
     },
     {
       "day": "monday",
       "program": "adults",
       "content": "11"
    },
    {
       "day": "tuesday",
       "program": "adults",
       "content": "12"
   },
   {
       "day": "wednesday",
       "program": "adults",
       "content": "13"
     },
     {
       "day": "thursday",
       "program": "adults",
       "content": "14"
   }, {
       "day": "friday",
       "program": "adults",
       "content": "15"
   }

      ],

    "home": [
      {
        "title": "bannerImg",
        "pageContent": "<img src=\".\/images\/tjj_logo.png\" alt=\"Tecumseh Jiu Jitsu\" \/>"
      },
      {
        "title": "bannerTitle",
        "pageContent": "<p style={{ fontSize: \"1.8em\"}}> Welcome to Tecumseh Jiu Jitsu!<\/p>"
      },
      {
        "title": "infoLeft",
        "pageContent": "<h3 className=\"center-align\">What is Brazilian Jiu Jitsu?<\/h3><p className=\"boxtext\">Brazilian Jiu-Jitsu is a martial art, combat sport and self-defense system that focuses on grappling and specifically ground fighting techniques. The art is derived from Japanese Kodokan Judo and teaches that a smaller and physically weaker person can successfully defend against a larger and physically stronger attacker with the correct use of leverage and understanding of bio-mechanics.<\/p>"
      },
      {
        "title": "infoCentre",
        "pageContent": "<h3 className=\"center-align\">History of Ribeiro Jiu Jitsu<\/h3>\r\n<p className=\"boxtext\">The Ribeiro Jiu-Jitsu Association (RJJA) was founded in 1995 by the legendary Saulo Ribeiro and is currently one of the most successful BJJ teams in the world. Saulo Ribeiro is considered to be one of the premier BJJ instructors in the world today and one of the greatest BJJ champions in history. Saulo has produced many champions under his leadership, but the one who stands out the most is his younger brother, Alexandre “Xande” Ribeiro. Xande Ribeiro is a 3rd degree Black Belt in Jiu-Jitsu, a six time World Jiu-Jitsu Champion, and two time ADCC Submission Grappling World Champion. Today, Saulo Ribeiro, alongside his brother Alexandre “Xande” Ribeiro teaches at the University of Jiu-Jitsu in San Diego, California, which they also founded. They also make time to visit each of the RJJA academies every year to teach and provide their mentorship.<\/p>"
      },
      {
        "title": "infoRight",
        "pageContent": "<h3 className=\"center-align\">Tecumseh Jiu Jitsu<\/h3><p className=\"boxtext\">Tecumseh Jiu Jitsu was founded by Miss Loree and Dean Hersche as Kingsville Martial Arts Academy. After years of successful operation in Kingsville, Dean and Miss Loree relocated to Tecumseh and rebranded the school as Tecumseh Martial Arts Academy. In continuing the proven legacy of the best Brazilian Jiu Jitsu instruction in the area, Eric Marentette and Miss Loree currently teach Brazilian Jiu-Jitsu to people of all ages. Tecumseh Jiu Jitsu maintains its strong ties to the Ribeiro Jiu-Jitsu Association (RJJA) and its teachings.<\/p>"
      },
      {
        "title": "locLeft",
        "pageContent": "<h3>Location<\/h3><p>12365 Tecumseh Rd E, Windsor, ON N8N 1M5 <\/p>\r\n<p style={{fontSize: \"0.8em\"}}> We are conveniently located at 12365 Tecumseh Road East in Tecumseh, Ontario. This location allows us to service clients from Windsor, Tecumseh, Lakeshore and the rest of Essex County.<\/p>"
      },
      {
        "title": "locRight",
        "pageContent": "<iframe title=\"Map to TJJ\" width=\"600\" height=\"350\" frameBorder=\"0\" style={{border: \"0\", marginTop: \"7px\"}} src=\"https:\/\/www.google.com\/maps\/embed\/v1\/place?q=Ribeiro%20Jiu-Jitsu%20Tecumseh&key=AIzaSyCnFCGtFepTtGvVy9GnKJdDXMjH28n8SHM\" allowFullScreen><\/iframe>"
      }

    ]
     
  }